app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_param(:name, :address, :phone, :email))
    @contact.save
---
INSERT INTO "contacts" ("name", "address", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "ikram"], ["address", "awan market nadeem chowk"], ["phone", "03120300210"], ["created_at", "2022-08-05 14:27:31.630062"], ["updated_at", "2022-08-05 14:27:31.630062"]]

  def update
    @contact = Contact.find(params[:id])
    @contact.update(contact_param(:name, :address, :phone, :email))
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "contacts" SET "name" = ?, "address" = ?, "phone" = ?, "email" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["name", "Alana Peterson"], ["address", "In fugit molestias "], ["phone", "+1 (342) 772-8503"], ["email", "rokylig@mailinator.com"], ["updated_at", "2022-08-05 15:26:01.432505"], ["id", 2]]

  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 5]]

  def edit
    @contact = Contact.find(params[:id])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]